#+TITLE: Verify an Org-mode environment
#+OPTIONS: num:nil ^:nil
#+LaTeX_CLASS: normal
#+STARTUP: hideblocks
#+TODO: TODO | DONE

Check an Org-mode environment.

*warning*: executing the table in this buffer will execute elisp and
 shell commands on your system.  These commands are intended to check
 aspects of your environment for compatibility with Org-mode, however
 malicious people could tie arbitrary and/or malicious code blocks to
 this table.
 - don't be malicious, only put reasonable code into this buffer
 - don't be angry, you've been warned about the possible risks of
   using this buffer
   
 In general Org-moders are very nice and will most likely keep this
 buffer both safe and useful.

** Source
#+srcname: copy-to-worg
#+begin_src sh :exports none :results output
  cd ~/org/Worg/
  git pull
  cp ~/org/org-check/org-check.org  ~/org/Worg/org-contrib/babel/examples/org-check.org
  git add org-contrib/babel/examples/org-check.org
  git commit -m "Additions to org-check.org"
  git push
#+end_src

#+results: copy-to-worg
#+begin_example
Already up-to-date.
[master 25fb17b] Additions to org-check.org
 1 files changed, 95 insertions(+), 66 deletions(-)
Counting objects: 11, done.
Delta compression using up to 2 threads.
Compressing objects:  16% (1/6)   Compressing objects:  33% (2/6)   Compressing objects:  50% (3/6)   Compressing objects:  66% (4/6)   Compressing objects:  83% (5/6)   Compressing objects: 100% (6/6)   Compressing objects: 100% (6/6), done.
Writing objects:  16% (1/6)   Writing objects:  33% (2/6)   Writing objects:  50% (3/6)   Writing objects:  66% (4/6)   Writing objects:  83% (5/6)   Writing objects: 100% (6/6)   Writing objects: 100% (6/6), 1.38 KiB, done.
Total 6 (delta 5), reused 0 (delta 0)
To git+ssh://repo.or.cz/srv/git/Worg.git
   108db30..25fb17b  master -> master
#+end_example
